<?php

use Illuminate\Database\Seeder;
use App\Article;
use Illuminate\Support\Facades\DB;

class ArticlesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        //Article::truncate();
        DB::table('articles')->truncate();

        Article::create([
            'title'         =>  'مقال تجريبي أول',
            'author'        =>  'محمد',
            'description'   =>  'تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول تفاصيل مقال تجريبي أول',
        ]);
        Article::create([
            'title'         =>  'مقال تجريبي ثاني',
            'author'        =>  'خالد',
            'description'   =>  'تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني تفاصيل مقال تجريبي ثاني',
        ]);
        Article::create([
            'title'         =>  'مقال تجريبي ثالث',
            'author'        =>  'مريم',
            'description'   =>  'تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث تفاصيل مقال تجريبي ثالث',
        ]);
        Article::create([
            'title'         =>  'مقال تجريبي رابع',
            'author'        =>  'صهيب',
            'description'   =>  'تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع تفاصيل مقال تجريبي رابع',
        ]);
        Article::create([
            'title'         =>  'مقال تجريبي خامس',
            'author'        =>  'محمد',
            'description'   =>  'تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس تفاصيل مقال تجريبي خامس',
        ]);
        Article::create([
            'title'         =>  'مقال تجريبي سادس',
            'author'        =>  'مريم',
            'description'   =>  'تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس تفاصيل مقال تجريبي سادس',
        ]);
    }
}
